antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
#include "app_common.h"

// needed for setenv and tzset :-/
#undef __STRICT_ANSI__
#include "time.h"
#include "stdlib.h"

#include "esp_sleep.h"
#include "esp_log.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include <math.h>
#ifndef DISABLE_WIFI
#include "esp_wifi.h"
#include "esp_netif.h"
#include "esp_netif_sntp.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "freertos/event_groups.h"
#include <string.h>
#endif

#include "Display.h"
#include "TempHistory.h"

// Used for JTAG. Avoid for other purposes if possible
// Firebeetle Pin | JTAG PIN
//            12  |  TDI
//            13  |  TCK
//            14  |  TMS
//            15  |  TDO
// JTAG init and deep sleep don't seem to play well together
// openocd errors when trying to init JTAG during deep sleep:
//   Error: JTAG scan chain interrogation failed: all ones
//   Error: Check JTAG interface, timings, target power, etc.
//   Error: Trying to use configured scan chain anyway...
//   Error: esp32.cpu0: IR capture error; saw 0x1f not 0x01
// when that error is hit you might need to kill the openocd process even if debugging is stopped in VS code
// Repro cmd
// ~/.platformio/packages/tool-openocd-esp32/bin/openocd -s ~/.platformio/packages/tool-openocd-esp32 -c "gdb_port pipe; tcl_port disabled; telnet_port disabled" -s ~/.platformio/packages/tool-openocd-esp32/share/openocd/scripts -f interface/ftdi/esp32_devkitj_v1.cfg -f board/esp-wroom-32.cfg -c "adapter_khz 5000"

#if defined(USE_DS18B20_PAR)
  #include "sensors/DS18B20Sensor.hpp"
  DS18B20Sensor sensor;
#elif defined(USE_BMP390L)
  #include "sensors/BMP390LSensor.hpp"
  BMP390LSensor sensor;
#elif defined(USE_BMP58x)
  #include "sensors/BMP58xSensor.hpp"
  BMP58xSensor sensor;
#elif defined(USE_DUMMY_SENSOR)
  #include "sensors/DummySensor.hpp"
  DummySensor sensor;
#else
  #error "Unknown sensor type"
#endif

#if defined(HAS_ULP_SUPPORT) && defined(SOC_ULP_FSM_SUPPORTED)
void ulp_check_data_overlap();
#endif

#if defined(HAS_ULP_SUPPORT) && defined(SOC_LP_CORE_SUPPORTED) && SOC_LP_CORE_SUPPORTED
#include "ulp_main.h"  // exposes ulp_lp_wake_count and other LP-core globals
#endif

// --- RTC memory layout ---
// RTC memory survives deep sleep but NOT power-on reset (firmware upload,
// battery swap, reset button). RTC_NOINIT_ATTR doesn't help — the FireBeetle
// board's reset circuit causes a full RTC power cycle on every reset.
//
// History is grouped in a struct with a version tag and self_addr field.
// The self_addr detects if the linker moved the struct (e.g. due to
// adding/removing other RTC variables). On power-on reset, .rtc.data is
// zeroed, version won't match, and history is reinitialized cleanly.
//
// Bump RTC_HISTORY_VERSION when changing anything inside RtcHistory
// (struct fields, buffer sizes, semantics).
// Bump RTC_STATE_VERSION when changing operational state variables below.
#define RTC_HISTORY_VERSION 0xDA050003
#define RTC_STATE_VERSION   0xDA050001

// Initial min/max temperature sentinels (float).
// Any real reading will replace these on first comparison.
#define TEMP_INIT_MIN  999.0f
#define TEMP_INIT_MAX (-999.0f)

// Minimum temperature change (C) to trigger a display refresh
#define DISPLAY_TEMP_DELTA 0.1f

// History data — new fields must be added at the END (and bump
// RTC_HISTORY_VERSION). The self_addr field detects if the linker moved
// the struct between firmware versions.
struct RtcHistory {
  uint32_t version;
  uint32_t self_addr;  // &historical_data at init time; detects address shifts

  // 24h sparkline (linear, oldest first — see TempHistory.h)
  TempReading temp[TEMP_HISTORY_SIZE];
  uint16_t temp_count;

  // 30-day hourly chart (circular buffer, one entry per clock hour)
  HourlyEntry hourly[HOURLY_HISTORY_SIZE];
  uint16_t hourly_count;
  uint16_t hourly_idx;
  time_t hourly_latest_time;

  // In-progress hour accumulator (finalized on hour boundary)
  time_t current_hour_start;
  int32_t  current_hour_sum_x10;
  uint16_t current_hour_sample_count;
  int16_t  current_hour_min_x10;
  int16_t  current_hour_max_x10;
};
RTC_DATA_ATTR RtcHistory historical_data;

// Operational state — changes here are caught by self_addr if the linker
// shifts historical_data, and by RTC_STATE_VERSION for format changes.
RTC_DATA_ATTR uint32_t rtc_state_version = 0;

RTC_DATA_ATTR int boot_count = 0;
RTC_DATA_ATTR int display_refresh_count = 0;

RTC_DATA_ATTR time_t first_boot_time = 0;
RTC_DATA_ATTR time_t next_clear_time = 0;
const time_t one_day = 86400;

RTC_DATA_ATTR float previous_temp = TEMP_NO_PREVIOUS;
RTC_DATA_ATTR int previous_boot_count = -1;

RTC_DATA_ATTR uint32_t max_battery_mv = 0;

RTC_DATA_ATTR uint32_t bad_pin27_count = 0;

// Min/max temperature since boot
RTC_DATA_ATTR float min_temp_since_boot = TEMP_INIT_MIN;
RTC_DATA_ATTR float max_temp_since_boot = TEMP_INIT_MAX;

// Periodic NTP resync state
RTC_DATA_ATTR time_t next_resync_time = 0;           // when to next attempt NTP resync
RTC_DATA_ATTR int32_t resync_interval_s = 7 * 86400; // current interval (starts at 1 week)
RTC_DATA_ATTR int32_t last_drift_ms = 0;             // drift measured at last resync (positive = clock ahead)
RTC_DATA_ATTR int32_t last_resync_interval_s = 0;    // interval at time of last drift measurement
RTC_DATA_ATTR time_t last_sync_time = 0;             // wall-clock of last successful NTP sync (0 = never)

// Status flags for display error indicators
RTC_DATA_ATTR bool wifi_ok = false;
RTC_DATA_ATTR bool ntp_synced = false;
RTC_DATA_ATTR bool last_sensor_ok = true;

// Update the hourly history buffer with a new temperature reading.
// Called on every main CPU wake (both delta-triggered and safety-net timer).
// When the clock hour changes, the accumulated entry is finalized and appended
// to the circular buffer. Any skipped hours (shouldn't happen normally since
// the safety net wakes every hour) are filled with sentinel entries.
static void update_hourly_history(time_t now, const struct tm *nowtm, float temp)
{
  int16_t temp_x10 = (int16_t)(temp * 10);

  // Compute wall-clock start-of-hour for current local time
  struct tm hour_tm = *nowtm;
  hour_tm.tm_min = 0;
  hour_tm.tm_sec = 0;
  time_t hour_start = mktime(&hour_tm);

  if (historical_data.current_hour_start != 0 && hour_start != historical_data.current_hour_start)
  {
    // Clock hour changed — finalize the completed hour's entry
    HourlyEntry entry;
    entry.min_x10 = historical_data.current_hour_min_x10;
    entry.max_x10 = historical_data.current_hour_max_x10;
    entry.avg_x10 = (historical_data.current_hour_sample_count > 0)
      ? (int16_t)(historical_data.current_hour_sum_x10 / historical_data.current_hour_sample_count)
      : historical_data.current_hour_min_x10;

    historical_data.hourly[historical_data.hourly_idx] = entry;
    historical_data.hourly_idx = (historical_data.hourly_idx + 1) % HOURLY_HISTORY_SIZE;
    if (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
      historical_data.hourly_count++;

    // Fill any skipped hours with the finalized entry's values.
    // Skipped hours mean the ULP safety-net woke but no delta was detected,
    // so temperature was stable — the last known value is the best estimate.
    // Uses time_t difference (UTC-based) so DST transitions are handled
    // correctly — a "spring forward" skip produces one fill, a "fall back"
    // repeat produces hours_elapsed=0 (no fill needed).
    int hours_elapsed = (int)((hour_start - historical_data.current_hour_start) / 3600);
    if (hours_elapsed > HOURLY_HISTORY_SIZE)
      hours_elapsed = HOURLY_HISTORY_SIZE;
    for (int i = 1; i < hours_elapsed; i++)
    {
      historical_data.hourly[historical_data.hourly_idx] = entry;  // repeat last known value
      historical_data.hourly_idx = (historical_data.hourly_idx + 1) % HOURLY_HISTORY_SIZE;
      if (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
        historical_data.hourly_count++;
    }

    // Update reference time: the last written entry's start-of-hour
    historical_data.hourly_latest_time = hour_start - 3600;

    // Reset accumulator for the new hour
    historical_data.current_hour_sum_x10 = 0;
    historical_data.current_hour_sample_count = 0;
    historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
    historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  }

