antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  // First reading after boot — initialize reference time
  if (historical_data.current_hour_start == 0)
    historical_data.hourly_latest_time = hour_start;

  historical_data.current_hour_start = hour_start;

  // Accumulate reading into current hour's stats
  historical_data.current_hour_sample_count++;
  historical_data.current_hour_sum_x10 += temp_x10;
  if (temp_x10 < historical_data.current_hour_min_x10)
    historical_data.current_hour_min_x10 = temp_x10;
  if (temp_x10 > historical_data.current_hour_max_x10)
    historical_data.current_hour_max_x10 = temp_x10;
}

static void update_temp_extremes(float temp)
{
  if (temp < min_temp_since_boot)
    min_temp_since_boot = temp;
  if (temp > max_temp_since_boot)
    max_temp_since_boot = temp;
}

#ifdef MOCK_DISPLAY_DATA
#include "MockData.h"

static void fill_mock_data(time_t now)
{
  mock_fill_sparkline(now, historical_data.temp, &historical_data.temp_count);
  mock_fill_hourly(now, historical_data.hourly, &historical_data.hourly_count, &historical_data.hourly_idx,
                   &historical_data.hourly_latest_time);

  min_temp_since_boot = 18.5f;
  max_temp_since_boot = 22.8f;
  previous_temp = 22.1f;

  // Set up in-progress hour accumulator with mock values
  struct tm now_tm;
  localtime_r(&now, &now_tm);
  now_tm.tm_min = 0;
  now_tm.tm_sec = 0;
  historical_data.current_hour_start = mktime(&now_tm);
  historical_data.current_hour_sample_count = 3;
  historical_data.current_hour_sum_x10 = 223 * 3;  // 22.3°C × 3 readings
  historical_data.current_hour_min_x10 = 219;      // 21.9°C
  historical_data.current_hour_max_x10 = 228;      // 22.8°C
}
#endif

DisplayStats make_display_stats()
{
  // Compute circular buffer start index (oldest entry)
  uint16_t hourly_start = (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
    ? 0
    : historical_data.hourly_idx;

  // Map ESP-IDF wake cause to a portable int for display
  esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
  int wake = (cause == ESP_SLEEP_WAKEUP_ULP) ? 1 :
             (cause == ESP_SLEEP_WAKEUP_TIMER) ? 2 : 0;

  // Compute in-progress hour entry from accumulator
  bool has_current = (historical_data.current_hour_sample_count > 0);
  HourlyEntry current_entry = {};
  if (has_current)
  {
    current_entry.min_x10 = historical_data.current_hour_min_x10;
    current_entry.max_x10 = historical_data.current_hour_max_x10;
    current_entry.avg_x10 = (int16_t)(historical_data.current_hour_sum_x10 / historical_data.current_hour_sample_count);
  }

  uint32_t lp_wakes = 0;
  uint32_t lp_errors = 0;
  int32_t  lp_last_err = 0;
  uint32_t lp_last_op = 0;
#if defined(HAS_ULP_SUPPORT) && defined(SOC_LP_CORE_SUPPORTED) && SOC_LP_CORE_SUPPORTED
  // These counters live in the LP core's .bss, which is zeroed only by
  // InitializeUlp() (ulp_lp_core_load_binary() doesn't touch .bss). On a cold
  // boot that runs *after* this render, so the symbols still hold uninitialised
  // SRAM — leave the stats at 0 until an LP/timer wake proves the LP core has
  // run this power cycle. Avoids a phantom "! LP" indicator on the first frame.
  if (wake != 0)
  {
    lp_wakes    = ulp_lp_wake_count;
    lp_errors   = ulp_lp_error_count;
    lp_last_err = (int32_t)ulp_last_lp_error;
    lp_last_op  = ulp_last_lp_op;
  }
#endif

  return {
    boot_count, previous_boot_count, display_refresh_count,
    lp_wakes, lp_errors, lp_last_err, lp_last_op,
    first_boot_time, next_clear_time, max_battery_mv, bad_pin27_count,
    sensor.SupportsUlp(), wake, wifi_ok, ntp_synced, last_sensor_ok,
#ifdef USE_DUMMY_SENSOR
    true,
#else
    false,
#endif
#ifdef MOCK_DISPLAY_DATA
    true,
#else
    false,
#endif
    // power_efficient: true only when serial is off, sleep interval is
    // production-length, and no debug instrumentation
#if defined(DISABLE_SERIAL) && SLEEP_INTERVAL_S >= 60 && !defined(PPK2_DEBUG)
    true,
#else
    false,
#endif
    last_drift_ms, last_resync_interval_s, last_sync_time,
    previous_temp, min_temp_since_boot, max_temp_since_boot,
    historical_data.temp, historical_data.temp_count,
    historical_data.hourly, historical_data.hourly_count, hourly_start,
    historical_data.hourly_latest_time, current_entry, has_current
  };
}

void setup_serial()
{
#ifndef DISABLE_SERIAL
  // The IDF console (UART on the FireBeetle, USB-Serial-JTAG on the C6, per
  // sdkconfig) is ready before app_main — nothing to set up.
  LOGI("Logging to log facilities - info");
#else
  // TODO: update our own logging levels when using JTAG debugging
  esp_log_level_set("*", ESP_LOG_ERROR);
#endif
}

void start_deep_sleep()
{
  if (sensor.SupportsUlp())
  {
    // ULP is polling the sensor — it will wake us when temperature changes
    esp_sleep_enable_ulp_wakeup();
    // Timer safety net for periodic housekeeping (display clear, battery check)
    esp_sleep_enable_timer_wakeup(ULP_SAFETY_NET_US);
    LOGI("Sleeping with ULP wakeup (timer safety net: %d min)", (int)(ULP_SAFETY_NET_US / 60000000ULL));
  }
  else
  {
    esp_sleep_enable_timer_wakeup((uint64_t)SLEEP_INTERVAL_S * 1000000ULL);
    LOGI("Sleeping for %d seconds", SLEEP_INTERVAL_S);
  }
  fflush(stdout);
  PPK2_CPU_ACTIVE_LOW();
  esp_deep_sleep_start();
}

void get_time(time_t *now, struct tm *nowtm)
{
  setenv("TZ", MY_TZ, 1);
  tzset();
  time(now);
  localtime_r(now, nowtm);
}

#ifndef DISABLE_WIFI
// Connect to WiFi with timeout. Returns true on success.
static const uint32_t WIFI_TIMEOUT_MS = 15000;

static EventGroupHandle_t s_wifi_events;
static esp_event_handler_instance_t s_wifi_handler, s_ip_handler;
static volatile bool s_wifi_stopping = false;
#define WIFI_CONNECTED_BIT BIT0

static void wifi_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data)
{
  if (base == WIFI_EVENT && id == WIFI_EVENT_STA_START)
    esp_wifi_connect();
  else if (base == WIFI_EVENT && id == WIFI_EVENT_STA_DISCONNECTED)
  {
    // Keep retrying until the timeout in wifi_connect() expires
    if (!s_wifi_stopping)
      esp_wifi_connect();
  }
  else if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP)
    xEventGroupSetBits(s_wifi_events, WIFI_CONNECTED_BIT);
}

