antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  adc_oneshot_unit_handle_t unit;
  adc_oneshot_unit_init_cfg_t ucfg = {};
  ucfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&ucfg, &unit) != ESP_OK)
  {
    LOGI("ERROR: ADC unit init failed");
    return adc_fail_mv;
  }
  adc_oneshot_chan_cfg_t ccfg = {};
  ccfg.atten = ADC_ATTEN_DB_12;
  ccfg.bitwidth = ADC_BITWIDTH_DEFAULT;
  adc_oneshot_config_channel(unit, ADC_CHANNEL_6, &ccfg);

  adc_cali_handle_t cali = nullptr;
  adc_cali_line_fitting_config_t lcfg = {};
  lcfg.unit_id = ADC_UNIT_1;
  lcfg.atten = ADC_ATTEN_DB_12;
  lcfg.bitwidth = ADC_BITWIDTH_DEFAULT;
  adc_cali_create_scheme_line_fitting(&lcfg, &cali);

  int raw = 0, mv = 0;
  bool read_ok = (adc_oneshot_read(unit, ADC_CHANNEL_6, &raw) == ESP_OK);
  if (cali)
  {
    adc_cali_raw_to_voltage(cali, raw, &mv);
    adc_cali_delete_scheme_line_fitting(cali);
  }
  else
  {
    mv = raw * 3100 / 4095; // uncalibrated fallback, 12dB full scale ~3.1V
  }
  adc_oneshot_del_unit(unit);

  if (!read_ok)
  {
    LOGI("ERROR: ADC read failed");
    return adc_fail_mv;
  }

  uint32_t battery_mv = (uint32_t)mv * 2;
  LOGI("Battery level: %d mV", (int)battery_mv);
  return battery_mv;
#elif defined(ARDUINO_XIAO_ESP32C6)
  // https://wiki.seeedstudio.com/xiao_esp32c6_getting_started/#reading-battery-voltage
  // Requires wiring A0/GPIO0 to VBAT see https://wiki.seeedstudio.com/XIAO_ESP32C3_Getting_Started/#check-the-battery-voltage
  return 4321; // TODO: remove this once proper circuit has been soldered
#else
  #error "Unknown board type"
#endif
}

#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  #include "Adafruit_NeoPixel.h"
  Adafruit_NeoPixel status_led(1, 5 /*data pin*/, NEO_GRB + NEO_KHZ800);
#elif defined(ARDUINO_XIAO_ESP32C6)
  #define STATUS_LED_PIN 15 // GPIO 15 (LED_BUILTIN), yellow, active-high
#else
  #error "Unknown board type"
#endif
#endif

static uint32_t rgb(uint8_t r, uint8_t g, uint8_t b)
{
  return ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
}

void initialize_status_led()
{
#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  status_led.begin();
  status_led.setBrightness(128);
#elif defined(ARDUINO_XIAO_ESP32C6)
  gpio_out_init(STATUS_LED_PIN);
  gpio_set_level((gpio_num_t)STATUS_LED_PIN, 0);
#else
  #error "Unknown board type"
#endif
#endif
}

void set_status_led(uint32_t color)
{
#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  // Looks like Red is a greenish tint
  // Green and Blue both show up correct
  status_led.setPixelColor(0, color);
  status_led.show();
#elif defined(ARDUINO_XIAO_ESP32C6)
  // Single-color yellow LED
  gpio_set_level((gpio_num_t)STATUS_LED_PIN, color != 0 ? 1 : 0);
#else
  #error "Unknown board type"
#endif
#endif
}

void clear_status_led()
{
#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  status_led.clear();
  status_led.show();
#elif defined(ARDUINO_XIAO_ESP32C6)
  gpio_set_level((gpio_num_t)STATUS_LED_PIN, 0);
#else
  #error "Unknown board type"
#endif
#endif
}

float read_temperature()
{
  LOGI("Getting temperature");
  float temp = sensor.GetTemperatureC();
  LOGI("temp: %f °C", temp);
  return temp;
}

uint16_t buttonRead(uint8_t pin)
{
  gpio_config_t cfg = {};
  cfg.pin_bit_mask = 1ULL << pin;
  cfg.mode = GPIO_MODE_INPUT;
  cfg.pull_up_en = GPIO_PULLUP_ENABLE;
  gpio_config(&cfg);
  return gpio_get_level((gpio_num_t)pin); // return 0 when pressed
}

#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
#define SHUTDOWN_BUTTON_PIN 27
#elif defined(ARDUINO_XIAO_ESP32C6)
#define SHUTDOWN_BUTTON_PIN 9
#else
  #error "Unknown board type"
#endif

void handle_permanent_shutdown(uint32_t battery_mv)
{
  uint16_t pin27 = buttonRead(SHUTDOWN_BUTTON_PIN);
  LOGI("Button read %d: %d", SHUTDOWN_BUTTON_PIN, pin27);
  if (pin27 == 0 || battery_mv < no_battery_mv)
  {
    // If button is pressed or battery is dead, powerdown
    if (pin27 == 0)
    {
      // Looks like we might be getting extremely rare spurious reads of 0
      // Double check after a delay ...
      sleep_ms(1000);
      pin27 = buttonRead(SHUTDOWN_BUTTON_PIN);
      LOGI("Button read %d confirmation: %d", SHUTDOWN_BUTTON_PIN, pin27);
      if (pin27 != 0)
      {
        bad_pin27_count++;
        return;
      }

      display_clear();

      // ... and add somethign on screen for diagnostics purposes in case the delay isn't sufficient
      // TODO remove this later
      display_show_pin27_diagnostic(boot_count);
    }
    else //  battery_mv < no_battery_mv
    {
      time_t now;
      struct tm nowtm;
      get_time(&now, &nowtm);
      display_show_empty_battery(battery_mv, now, make_display_stats());
    }

    for (int domain = 0; domain < ESP_PD_DOMAIN_MAX; domain++)
      esp_sleep_pd_config((esp_sleep_pd_domain_t)domain, ESP_PD_OPTION_OFF);
    LOGI("Shutting down until reset. All sleep pd domains have been shutdown.");
    esp_deep_sleep_start();
  }
}

void on_first_boot()
{
#ifdef DISABLE_WIFI
  LOGI("WiFi has been disabled at build time with DISABLE_WIFI. See local-secrets.h to fix.");
  // Not an error — suppress "! NO WIFI" indicator on display
  wifi_ok = true;
  set_status_led(rgb(255, 255, 0));
  sleep_ms(100);
#else
  #if !(defined(MY_WIFI_SSID) && defined(MY_WIFI_PASSWORD))
    #error "MY_WIFI_SSID and/or MY_WIFI_PASSWORD are not defined. See local-secrets.h to fix."
  #endif
  if (*MY_WIFI_SSID == 0)
  {
    LOGI("Missing WiFi SSID. Will assume network connectivity isn't possible. See local-secrets.h to fix.");
    return;
  }

  // Connect to WiFi with timeout (avoids hanging forever if network is down)
  LOGI("Connecting to WiFi");
  set_status_led(rgb(0, 0, 255));

  if (!wifi_connect())
  {
    // wifi_ok stays false, ntp_synced stays false
    return;
  }
  LOGI("Connected to WiFi");
  wifi_ok = true;

  // Synchronize time via NTP
  LOGI("Synchronizing time");
  set_status_led(rgb(0, 255, 0));
  if (!sntp_sync_once(30000U /* max wait time in ms */))
    LOGI("NTP sync failed — time is unreliable");
  time(&first_boot_time);

  // Verify sync succeeded (time should be well past epoch)
  ntp_synced = (first_boot_time > 86400 * 365);
  if (ntp_synced)
    last_sync_time = first_boot_time;

  wifi_disconnect();
  LOGI("WiFi disconnected");
#endif
}


bool periodic_display_clear(const time_t now, struct tm nowtm)
{
  // Trigger screen clear daily
  if (next_clear_time == 0)
  {
    if (now < one_day)
    {
      // We don't seem to have a synchronized clock, clear screen periodically from first boot
      next_clear_time = now + one_day;
    }
    else
    {
      // We have a synchronzied clock, clear screen periodically when it's likely to be least disruptive
      // Let's pick the next time it's 04h00
      time_t offset = 0;
      if (4 <= nowtm.tm_hour)
      {
        offset = one_day;
      }
      nowtm.tm_hour = 4;
      nowtm.tm_min = 0;
      nowtm.tm_sec = 0;
      next_clear_time = mktime(&nowtm) + offset;
    }
  }

  if (now < next_clear_time)
  {
    return false;
  }

  display_clear();
  next_clear_time += one_day; // Schedule next clear in a day
  return true;
}

void refresh_and_sleep(uint32_t battery_mv, float temp)
{
  time_t now;
  struct tm nowtm;
  get_time(&now, &nowtm);

#ifndef DISABLE_WIFI
  maybe_ntp_resync(now);
  // Re-read time after potential resync correction
  get_time(&now, &nowtm);
#endif

